//================================================================================
// m2v_dec_eval - MPEG2 ビデオストリーム ビットデコーダ
// ref: ISO13818-2
// $Id$
//================================================================================

#include "m2v_dec.h"
#include "bitreader.h"

////////////////////////////////////////////////////////////////////////////////
// @brief ビットデコード実行
//
// 指定したビットストリームに対し、デコードを実行する。読み込んだデータを
// 保管し、
//
// @param bs デコード対象のビットストリーム
//
int do_bitdecode(bitstream* bs)
{
}

